Repository: aziznizomofficial/kotiba
Catalog: Sources/KotibaUI/Resources/Localizable.xcstrings
Source language: en
Languages: ru, uz_cyrl, uz_latn

# settings.setup
source: Setup
ru: Первоначальная настройка
uz_cyrl: Дастлабки созлаш
uz_latn: Dastlabki sozlash

# settings.setup.again
source: Run the first-run setup again
ru: Пройти первоначальную настройку заново
uz_cyrl: Дастлабки созлашни қайтадан ўтиш
uz_latn: Dastlabki sozlashni qaytadan oʻtish

# settings.setup.again.detail
source: Language, permissions, hotkey, models and Always on, one step at a time.
ru: Язык, разрешения, горячая клавиша, модели и «Всегда включена» — шаг за шагом.
uz_cyrl: Тил, рухсатлар, тезкор тугма, моделлар ва «Доим ёниқ» — босқичма-босқич.
uz_latn: Til, ruxsatlar, tezkor tugma, modellar va «Doim yoniq» — bosqichma-bosqich.

# settings.setup.start
source: Start
ru: Начать
uz_cyrl: Бошлаш
uz_latn: Boshlash

# settings.silence
source: Silence threshold
ru: Порог тишины
uz_cyrl: Сукунат чегараси
uz_latn: Sukunat chegarasi

# settings.silence.detail
source: Below this, Kotiba says it heard nothing rather than pasting an empty line.
ru: Ниже этого уровня Kotiba сообщит, что ничего не услышала, вместо того чтобы вставлять пустую строку.
uz_cyrl: Бу даражадан паст бўлса, Kotiba бўш қатор жойлаштириш ўрнига ҳеч нарса эшитмаганини айтади.
uz_latn: Bu darajadan past boʻlsa, Kotiba boʻsh qator joylashtirish oʻrniga hech narsa eshitmaganini aytadi.

# settings.sound
source: Sound
ru: Звук
uz_cyrl: Овоз
uz_latn: Ovoz

# settings.sound.feedback
source: Play a sound when recording starts and stops
ru: Звуковой сигнал в начале и в конце записи
uz_cyrl: Ёзиш бошланганда ва тугаганда овозли сигнал бериш
uz_latn: Yozish boshlanganda va tugaganda ovozli signal berish

# settings.unreadable.all
source: the saved settings could not be read; a copy has been kept
ru: сохранённые настройки не удалось прочитать; копия сохранена
uz_cyrl: сақланган созламаларни ўқиб бўлмади; нусхаси сақлаб қўйилди
uz_latn: saqlangan sozlamalarni oʻqib boʻlmadi; nusxasi saqlab qoʻyildi

# settings.unreadable.some
source: these settings could not be read and were left at their defaults: %@
ru: эти настройки не удалось прочитать, и они сброшены к значениям по умолчанию: %@
uz_cyrl: бу созламаларни ўқиб бўлмади ва улар стандарт қийматларда қолдирилди: %@
uz_latn: bu sozlamalarni oʻqib boʻlmadi va ular standart qiymatlarda qoldirildi: %@

# sidebar.fold
source: Fold the sidebar
ru: Свернуть боковую панель
uz_cyrl: Ён панелни йиғиш
uz_latn: Yon panelni yigʻish

# sidebar.holdToDictate
source: Hold %@ to dictate
ru: Держите %@ и говорите
uz_cyrl: %@ ни босиб, гапиринг
uz_latn: %@ ni bosib, gapiring

# sidebar.tagline
source: On-device dictation
ru: Диктовка на устройстве
uz_cyrl: Қурилмада диктовка
uz_latn: Qurilmada diktovka

# sidebar.unfold
source: Unfold the sidebar
ru: Развернуть боковую панель
uz_cyrl: Ён панелни ёйиш
uz_latn: Yon panelni yoyish

# speech.arabic
source: Arabic
ru: Арабский
uz_cyrl: Араб тили
uz_latn: Arab tili

# speech.english
source: English
ru: Английский
uz_cyrl: Инглиз тили
uz_latn: Ingliz tili

# speech.russian
source: Russian
ru: Русский
uz_cyrl: Рус тили
uz_latn: Rus tili

# speech.turkish
source: Turkish
ru: Турецкий
uz_cyrl: Турк тили
uz_latn: Turk tili

# speech.unknown
source: Unknown
ru: Неизвестно
uz_cyrl: Номаълум
uz_latn: Nomaʼlum

# speech.uzbek
source: Uzbek
ru: Узбекский
uz_cyrl: Ўзбек тили
uz_latn: Oʻzbek tili

# stage.arming
source: Arming
ru: Подготовка
uz_cyrl: Тайёрланиш
uz_latn: Tayyorlanish

# stage.finalising
source: Finalising
ru: Завершение записи
uz_cyrl: Ёзувни якунлаш
uz_latn: Yozuvni yakunlash

# stage.inserting
source: Inserting
ru: Вставка
uz_cyrl: Жойлаштириш
uz_latn: Joylashtirish

# stage.loading
source: Loading
ru: Загрузка
uz_cyrl: Юклаш
uz_latn: Yuklash

# stage.polishing
source: Polishing
ru: Обработка
uz_cyrl: Таҳрирлаш
uz_latn: Tahrirlash

# stage.rerouting
source: Rerouting
ru: Повторный выбор языка
uz_cyrl: Тилни қайта аниқлаш
uz_latn: Tilni qayta aniqlash

# stage.routing
source: Routing
ru: Выбор языка
uz_cyrl: Тилни аниқлаш
uz_latn: Tilni aniqlash

# stage.transcribing
source: Transcribing
ru: Распознавание
uz_cyrl: Матнга айлантириш
uz_latn: Matnga aylantirish

# stats.byLanguage
source: By language
ru: По языкам
uz_cyrl: Тиллар бўйича
uz_latn: Tillar boʻyicha

# stats.byMode
source: By mode
ru: По режимам
uz_cyrl: Режимлар бўйича
uz_latn: Rejimlar boʻyicha

# stats.chart.hour
source: Dictations by hour
ru: Диктовки по часам
uz_cyrl: Соатлик диктовкалар
uz_latn: Soatlik diktovkalar

# stats.chart.month
source: Dictations per month
ru: Диктовки по месяцам
uz_cyrl: Ойлик диктовкалар
uz_latn: Oylik diktovkalar

# stats.chart.week
source: Dictations per week
ru: Диктовки по неделям
uz_cyrl: Ҳафталик диктовкалар
uz_latn: Haftalik diktovkalar

# stats.empty.all
source: Nothing dictated yet.
ru: Диктовок пока не было.
uz_cyrl: Ҳали диктовка бўлмаган.
uz_latn: Hali diktovka boʻlmagan.

# stats.empty.month
source: Nothing dictated in the last 30 days.
ru: За последние 30 дней диктовок не было.
uz_cyrl: Сўнгги 30 кунда диктовка бўлмади.
uz_latn: Soʻnggi 30 kunda diktovka boʻlmadi.

# stats.empty.today
source: Nothing dictated today yet.
ru: Сегодня вы ещё ничего не диктовали.
uz_cyrl: Бугун ҳали ҳеч нарса диктовка қилинмади.
uz_latn: Bugun hali hech narsa diktovka qilinmadi.

# stats.empty.week
source: Nothing dictated in the last 7 days.
ru: За последние 7 дней диктовок не было.
uz_cyrl: Сўнгги 7 кунда диктовка бўлмади.
uz_latn: Soʻnggi 7 kunda diktovka boʻlmadi.

# stats.footnote
source: From the %1$@ dictations still in the diagnostics log (it keeps the most recent ~2 MB), of which %2$@ heard nothing and %3$@ failed. Time saved is typing time at %4$lld words a minute, minus the time spent speaking and waiting.
ru: По %1$@ диктовкам, которые ещё хранятся в журнале диагностики (он хранит последние ~2 МБ); из них в %2$@ ничего не было услышано, а %3$@ завершились ошибкой. Сэкономленное время — это время набора со скоростью %4$lld слов в минуту за вычетом времени на речь и ожидание.
uz_cyrl: Диагностика журналида ҳали сақланаётган %1$@ та диктовка асосида (журнал сўнгги ~2 МБ ни сақлайди); улардан %2$@ тасида ҳеч нарса эшитилмаган, %3$@ таси хато билан тугаган. Тежалган вақт — дақиқасига %4$lld сўз тезликда териш вақтидан гапириш ва кутишга кетган вақт айирилгани.
uz_latn: Diagnostika jurnalida hali saqlanayotgan %1$@ ta diktovka asosida (jurnal soʻnggi ~2 MB ni saqlaydi); ulardan %2$@ tasida hech narsa eshitilmagan, %3$@ tasi xato bilan tugagan. Tejalgan vaqt — daqiqasiga %4$lld soʻz tezlikda terish vaqtidan gapirish va kutishga ketgan vaqt ayirilgani.

# stats.latency.caption
source: median · p90 %@
ru: медиана · p90 %@
uz_cyrl: медиана · p90 %@
uz_latn: mediana · p90 %@

# stats.noDictations
source: No dictations yet.
ru: Диктовок пока нет.
uz_cyrl: Ҳозирча диктовкалар йўқ.
uz_latn: Hozircha diktovkalar yoʻq.

# stats.noTimings
source: No timings recorded yet.
ru: Замеров времени пока нет.
uz_cyrl: Ҳозирча вақт ўлчовлари йўқ.
uz_latn: Hozircha vaqt oʻlchovlari yoʻq.

# stats.nothing
source: Nothing recorded yet. Dictate something and come back.
ru: Пока ничего не записано. Надиктуйте что-нибудь и возвращайтесь.
uz_cyrl: Ҳозирча ҳеч нарса ёзилмаган. Бирор нарса айтиб, қайтиб келинг.
uz_latn: Hozircha hech narsa yozilmagan. Biror narsa aytib, qaytib keling.

# stats.perDay
source: Dictations per day
ru: Диктовок в день
uz_cyrl: Кунлик диктовкалар
uz_latn: Kunlik diktovkalar

# stats.period.all
source: All time
ru: Всё время
uz_cyrl: Бутун давр
uz_latn: Butun davr

# stats.period.month
source: Month
ru: Месяц
uz_cyrl: Ой
uz_latn: Oy

# stats.period.today
source: Today
ru: Сегодня
uz_cyrl: Бугун
uz_latn: Bugun

# stats.period.week
source: Week
ru: Неделя
uz_cyrl: Ҳафта
uz_latn: Hafta

# stats.reading
source: Reading the log…
ru: Читаю журнал…
uz_cyrl: Журнал ўқилмоқда…
uz_latn: Jurnal oʻqilmoqda…

# stats.saved
source: Time saved
ru: Сэкономлено времени
uz_cyrl: Тежалган вақт
uz_latn: Tejalgan vaqt

# stats.saved.caption
source: vs typing at %lld wpm
ru: против набора %lld слов/мин
uz_cyrl: дақиқасига %lld сўз теришга нисбатан
uz_latn: daqiqasiga %lld soʻz terishga nisbatan

# stats.since
source: Since %@.
ru: С %@
uz_cyrl: Ҳисоб бошланган сана: %@.
uz_latn: Hisob boshlangan sana: %@.

# stats.stages
source: Where the time goes
ru: На что уходит время
uz_cyrl: Вақт нимага кетади
uz_latn: Vaqt nimaga ketadi

# stats.stages.subtitle
source: Median per stage after you let go of the key.
ru: Медиана по этапам после того, как вы отпустили клавишу.
uz_cyrl: Тугмани қўйиб юборганингиздан кейинги ҳар бир босқичнинг медианаси.
uz_latn: Tugmani qoʻyib yuborganingizdan keyingi har bir bosqichning medianasi.

# stats.words
source: Words
ru: Слова
uz_cyrl: Сўзлар
uz_latn: Soʻzlar

# stats.words.caption
source: across %lld dictations
ru: в %lld диктовках
uz_cyrl: %lld та диктовкада
uz_latn: %lld ta diktovkada

# status.almostReady.title
source: Almost ready
ru: Почти готово
uz_cyrl: Деярли тайёр
uz_latn: Deyarli tayyor

# status.failed.title
source: Didn’t finish
ru: Не получилось
uz_cyrl: Якунланмади
uz_latn: Yakunlanmadi

# status.listening.detail
source: Let go of the key to paste.
ru: Отпустите клавишу, чтобы вставить текст.
uz_cyrl: Матнни жойлаштириш учун тугмани қўйиб юборинг.
uz_latn: Matnni joylashtirish uchun tugmani qoʻyib yuboring.

# status.listening.title
source: Listening
ru: Слушаю
uz_cyrl: Тинглаяпман
uz_latn: Tinglayapman

# status.loading.detail
source: Getting the %@ ready.
ru: Подготовка: %@.
uz_cyrl: Тайёрланмоқда: %@.
uz_latn: Tayyorlanmoqda: %@.

# status.loading.title
source: Loading
ru: Загрузка
uz_cyrl: Юкланмоқда
uz_latn: Yuklanmoqda

# status.ready.detail
source: Hold %@ anywhere, speak, and let go.
ru: Удерживайте %@ в любом приложении, говорите и отпустите.
uz_cyrl: Исталган жойда %@ тугмасини босиб туринг, гапиринг ва қўйиб юборинг.
uz_latn: Istalgan joyda %@ tugmasini bosib turing, gapiring va qoʻyib yuboring.

# status.ready.title
source: Ready
ru: Готово
uz_cyrl: Тайёр
uz_latn: Tayyor

# status.working.detail
source: Turning your words into text.
ru: Превращаю ваши слова в текст.
uz_cyrl: Сўзларингиз матнга айлантирилмоқда.
uz_latn: Soʻzlaringiz matnga aylantirilmoqda.

# status.working.limit
source: Reached the 30-minute limit — transcribing everything up to it.
ru: Достигнут предел в 30 минут — распознаю всё, что было сказано до него.
uz_cyrl: 30 дақиқалик чегарага етилди — шу пайтгача айтилганларнинг ҳаммаси матнга айлантирилмоқда.
uz_latn: 30 daqiqalik chegaraga yetildi — shu paytgacha aytilganlarning hammasi matnga aylantirilmoqda.

# status.working.title
source: Transcribing
ru: Распознаю
uz_cyrl: Матнга айлантирилмоқда
uz_latn: Matnga aylantirilmoqda

# unit.gb
source: %@ GB
ru: %@ ГБ
uz_cyrl: %@ ГБ

# unit.hours
source: %@ h
ru: %@ ч
uz_cyrl: %@ соат
uz_latn: %@ soat

# unit.kb
source: %@ KB
ru: %@ КБ
uz_cyrl: %@ КБ

# unit.mb
source: %@ MB
ru: %@ МБ
uz_cyrl: %@ МБ

# unit.millis
source: %@ ms
ru: %@ мс
uz_cyrl: %@ мс

# unit.minutes
source: %@ min
ru: %@ мин
uz_cyrl: %@ дақ
uz_latn: %@ daq

# unit.seconds
source: %@ s
ru: %@ с
uz_cyrl: %@ с

# words.capitalise
source: Capitalise sentences
ru: Заглавная буква в начале предложения
uz_cyrl: Гапларни бош ҳарф билан бошлаш
uz_latn: Gaplarni bosh harf bilan boshlash

# words.find
source: Find
ru: Найти
uz_cyrl: Топиш
uz_latn: Topish

# words.replaceWith
source: Replace with
ru: Заменить на
uz_cyrl: Нимага алмаштириш
uz_latn: Nimaga almashtirish

# words.replacements
source: Replacements
ru: Замены
uz_cyrl: Алмаштиришлар
uz_latn: Almashtirishlar

# words.replacements.footnote
source: Applied once, left to right. A replacement never feeds another one, so a rule cannot loop.
ru: Применяются один раз, слева направо. Одна замена никогда не запускает другую, поэтому правило не может зациклиться.
uz_cyrl: Бир марта, чапдан ўнгга қўлланади. Бир алмаштириш бошқасини ишга туширмайди, шунинг учун қоида айланиб қолмайди.
uz_latn: Bir marta, chapdan oʻngga qoʻllanadi. Bir almashtirish boshqasini ishga tushirmaydi, shuning uchun qoida aylanib qolmaydi.

# words.subtitle
source: Given to the model before it decodes, which fixes a word before it is misheard rather than after. Kotiba itself comes back as “cotta” without this.
ru: Передаются модели ещё до распознавания — так слово исправляется до того, как его неверно расслышат, а не после. Без этого даже «Kotiba» превращается в «cotta».
uz_cyrl: Танишдан олдин моделга берилади — шунда сўз нотўғри эшитилгандан кейин эмас, ундан олдин тузатилади. Бусиз ҳатто «Kotiba» ҳам «cotta» бўлиб чиқади.
uz_latn: Tanishdan oldin modelga beriladi — shunda soʻz notoʻgʻri eshitilgandan keyin emas, undan oldin tuzatiladi. Busiz hatto «Kotiba» ham «cotta» boʻlib chiqadi.

# words.term.placeholder
source: A name or term
ru: Имя или термин
uz_cyrl: Исм ёки атама
uz_latn: Ism yoki atama

# words.title
source: Words Kotiba gets wrong
ru: Слова, в которых Kotiba ошибается
uz_cyrl: Kotiba хато ёзадиган сўзлар
uz_latn: Kotiba xato yozadigan soʻzlar

# home.promo.label
source: How Kotiba works: hold the key, speak in Uzbek, English, Russian, Arabic or Turkish, let go, and the text arrives in the mode you picked.
ru: Как работает Kotiba: удерживайте клавишу, говорите по-узбекски, по-английски, по-русски, по-арабски или по-турецки, отпустите — и текст появится в выбранном режиме.
uz_cyrl: Kotiba қандай ишлайди: тугмани босиб туринг, ўзбекча, инглизча, русча, арабча ёки туркча гапиринг, қўйиб юборинг — матн сиз танлаган режимда чиқади.
uz_latn: Kotiba qanday ishlaydi: tugmani bosib turing, oʻzbekcha, inglizcha, ruscha, arabcha yoki turkcha gapiring, qoʻyib yuboring — matn siz tanlagan rejimda chiqadi.
